/**
  *************************************************************************************************
  * @file     adc.h
  * @author   罗涛
  * @version  V1.0.0
  * @date     2019.5.31
  * @brief    
  *************************************************************************************************
  * @attention
  *              
  *      
  *************************************************************************************************
  */
#include <Enable_sys_file.h>
/*Define to prevent recursive inclusion --------------------------------------------------------*/ 

#ifndef _ADC_H
#define _ADC_H

/*Includes ----------------------------------------------------------------------------------------*/

#include "stm32f10x.h"

/*Defines -----------------------------------------------------------------------------------------*/
/*Variables ---------------------------------------------------------------------------------------*/
/*Functions ---------------------------------------------------------------------------------------*/

void ADC_GPIO_Init(void);						//初始化ADC的GPIO,可用于单路或多路,根据实际使用情况添加裁剪

void ADC1_OneWay_Init(void);					//单路；ADC1 单通道初始化 
void ADC2_OneWay_Init(void);					//单路；ADC2 单通道初始化 

void ADC1_Multipath_Init(void);					//多路: 初始化ADC1通道0至通道6  	
void ADC1_Multipath_Init(void);					//多路: 初始化ADC2通道0至通道6  

u16 Get_Adc1(u8 ch);						    	 //获得ADC1值 
u16 Get_Adc2(u8 ch);						       //获得ADC2值 

u16 Get_Adc1_Average(u8 ch,u8 times);			//求ADC1平均值
u16 Get_Adc2_Average(u8 ch,u8 times);			//求ADC2平均值
											   
											   							   
#endif
/*---------------------------------------------- End -----------------------------------------------*/





