/**
  *************************************************************************************************
  * @file     coder.h
  * @author   1008 Laboratory
  * @version  V3.0.0
  * @date     2017.7.3
  * @brief    定时器编码器模式
  **************************************************************************************************
  * @attention
  *                
  *  				None
  * 
  **************************************************************************************************
  */
#include <Enable_sys_file.h>
/* Define to prevent recursive inclusion ----------------------------------------------------------*/
#ifndef _CODER_H
#define _CODER_H

/*Includes ----------------------------------------------------------------------------------------*/

#include "stm32f10x.h"

/*Defines -----------------------------------------------------------------------------------------*/

/*Variables ---------------------------------------------------------------------------------------*/

/*Functions ---------------------------------------------------------------------------------------*/

void TIM1_CODER_Init(void); //初始化定时器1编码器模式
void TIM2_CODER_Init(void); //初始化定时器2编码器模式
void TIM3_CODER_Init(void); //初始化定时器3编码器模式
void TIM4_CODER_Init(void); //初始化定时器4编码器模式
void TIM5_CODER_Init(void); //初始化定时器5编码器模式
void TIM8_CODER_Init(void); //初始化定时器8编码器模式

short TIM1_Getcoder(void); //读取定时器1的编码器值
short TIM2_Getcoder(void); //读取定时器2的编码器值
short TIM3_Getcoder(void); //读取定时器3的编码器值
short TIM4_Getcoder(void); //读取定时器4的编码器值
short TIM5_Getcoder(void); //读取定时器5的编码器值
short TIM8_Getcoder(void); //读取定时器8的编码器值

#endif

/*---------------------------------------------- End ------------------------------------------------*/
