/*******************************************************************************
  @File   : HC-05.c
  @Author : 罗涛
  @Date   : 2019年6月8日 10.40
  @Brief  : 蓝牙HC-05驱动
  @Others : none 
  @History: none
  Modification: V1.0.0
  
       1.使用操作见Example.txt
*******************************************************************************/
/* include *******************************************************************/
#include "HC-05.h"

void HC05_Init(uint8_t AT)
{
  USART_Config(USART1_CONFIG,115200);  /*初始化蓝牙连接的串口*/
 if(AT = 1)
 {
   
 }

}